app/views/invoice_mailer/send_invoice.html.erb

SELECT "purchase_items".* FROM "purchase_items" WHERE "purchase_items"."purchase_id" = 1
---
  <tbody>
    <% @purchase.purchase_items.each do |item| %>