app/views/bills/show.html.erb

SELECT "purchase_items".* FROM "purchase_items" WHERE "purchase_items"."purchase_id" = 4
---
            <tbody>
              <% @purchase.purchase_items.each do |item| %>