app/controllers/bills_controller.rb

SELECT "products".* FROM "products" WHERE "products"."product_id" = '1' LIMIT 1
---
  def create
    @purchase = Purchase.new(customer_email: params[:customer_email], paid_amount: params[:paid_amount])

    total_without_tax = 0
    total_tax = 0

    items_params = params[:items] || []
    if items_params.respond_to?(:values)
      items_params = items_params.values
    end

    ActiveRecord::Base.transaction do
      items_params.each do |item_data|
        prod_id = item_data["product_id"]
        qty = item_data["quantity"].to_i

        next if prod_id.blank? || qty <= 0

        product = Product.find_by(product_id: prod_id)

UPDATE "products" SET "stock" = 96, "updated_at" = '2026-01-03 09:48:00.507443' WHERE "products"."id" = 6
---
        total_tax += tax_payable

        # Update stock
        product.update!(stock: product.stock - qty)

INSERT INTO "purchases" ("customer_email", "total_without_tax", "total_tax", "net_price", "paid_amount", "rounded_net_price", "balance_payable", "created_at", "updated_at", "denominations_collected") VALUES ('kajal@gmail.com', 1400.0, 168.0, 1568.0, 666.0, 1568, -902.0, '2026-01-05 04:27:07.823307', '2026-01-05 04:27:07.823307', '{"500":8,"50":6,"20":5,"10":4,"5":3,"2":2,"1":1}') RETURNING "id"
---
      end
      @purchase.denominations_collected = collected

      if @purchase.save

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = 4 LIMIT 1
---
  def show
    @purchase = Purchase.find(params[:id])