app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "product_id", "stock", "price", "tax_percentage", "created_at", "updated_at") VALUES ('magi', '9', 5, 200.0, 2.0, '2026-01-03 10:03:10.635060', '2026-01-03 10:03:10.635060') RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

DELETE FROM "products" WHERE "products"."id" = 1
---
  def destroy
    @product.destroy!

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
    def set_product
      @product = Product.find(params.expect(:id))