app/controllers/purchases_controller.rb

  def index
    @purchases = Purchase.all.order(created_at: :desc)
---
SELECT "purchases".* FROM "purchases" ORDER BY "purchases"."created_at" DESC

  def show
    @purchase = Purchase.find(params[:id])
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = 1 LIMIT 1